#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
// 写一个函数, 返回参数二进制(补码)中1的个数
// 寻找1的个数有四种方法:
// 1. 一个一个寻找, 直到将二进制序列全部找完
// 2. n & 1, 若得到的是1, 就说明n的二进制序列最后一个数为1. 若为0, 说明最后一位为0. 然后右移
// 3. n % 2. 若为1, 说明最后一位为1, 若为0, 说明最后一位为0. 然后右移(计算%次数太多, 代码效率不高)
// 4. n & (n-1), 按位与后, 得到的值就会将右边的一位1变成0, 然后重复, 直到所有的1都变成0(最佳方法)
//int NumberOf1(int n) {
//	int count = 0;
//	while (n) {
//		n = n & (n - 1);
//		count++;
//	}
//	return count;
//}
//int main() {
//	int a = 14;
//	// 00000000000000000000000000001110  a
//	// 00000000000000000000000000001101  a-1
//	// 00000000000000000000000000001100  a & a-1
//	int ret = NumberOf1(a);
//	printf("%d\n", ret);
//	return 0;
//}

// 指针的定义
//int main() {
//	int a = 10;
//	int* pa = &a; // pa就为一个指针变量, 指向的是a的地址
//	return 0;
//}

// 指针的类型及大小
//int main() {
//	int a = 10;
//	double b = 3.14;
//	char c = 'a';
//	// 指针有整型指针, 字符型指针, 浮点型指针
//	int* pa = &a;
//	double* pb = &b;
//	char* pc = &c;
//	// 指针在32位系统下均为4个字节
//	printf("%d\n", sizeof(pa)); // 4
//	printf("%d\n", sizeof(pb)); // 4
//	printf("%d\n", sizeof(pc)); // 4
//	return 0;
//}

// 指针的类型
//int main() {
//	int a = 0x11223344;
//	//int* pa = &a; // 44 33 22 11
//	//*pa = 0;  // 00 00 00 00
//	//printf("%d\n", a); 
//
//	char* pb = &a; // 44 33 22 11
//	*pb = 0;	
//	printf("%d\n", a); // 00 33 22 11
//	return 0;
//}
// 由此可见可以用不同类型指针去存储变量, 但是若要改变变量, 就会受到指针类型的影响

// 指针类型是有意义的
// 1. 指针类型决定了指针在进行解引用操作的时候能够访问多大的空间
//    char* 类型的指针只能访问一个字节大小的空间, int* 类型的指针可以访问4个字节大小的空间
// 2. 指针类型决定了指针+1, 跳过多少个字节(走一步, 会走多大的距离)
//    char* + 1 , 向后跳1个字节
//    int* + 1, 向后跳4个字节

// 指针+1操作
//int main() {
//	int a = 10;
//	char b = '0';
//	int* pa = &a;
//	char* pb = &b;
//	printf("%p\n", pa); // 010FFA98
//	printf("%p\n", pa + 1); // 010FFA9C
//
//	printf("%p\n", pb); //010FFA8F
//	printf("%p\n", pb + 1);// 010FFA90
//	return 0;
//}

// 用指针打印数组的各个元素
//int main() {
//	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	int* p = arr;
//	int i = 0;
//	for (i = 0; i < 10; i++) {
//		printf("%d ", *(p + i));
//	}
//	return 0;
//}

// 使用不同的指针类型解引用数组元素
//int main() {
//	int arr[10] = { 0x11223344, 0x11223344, 0x11223344, 0x11223344,
//	0x11223344, 0x11223344, 0x11223344, 0x11223344, 0x11223344, 0x11223344 };
//	int* pa = arr;
//	// char* pb = arr;
//	int i = 0; 
//	for (i = 0; i < 10; i++) {
//		*(pa + i) = 0;
//		//printf("%d ", *(pa + i)); // 0 0 0 0 0 0 0 0 0 0
//		//*(pb + i) = 0; 
//	}
//	return 0;
//}