#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <math.h>
// 一个数如果恰好等于它的因子(不包括本身)之和, 这个数就叫做完数(完全数). 
// 找出1000以内的所有完数
// 例: 6 = 1 + 2 + 3
int main() {
	int i = 1;
	for (i = 1; i <= 1000; i++) {  // 找出1-1000的数字
		int sum = 0;
		for (int j = 1; j < i; j++) {
			if (i % j == 0) {  // 找出每个数的因子
				sum = sum + j;
			}
		}
		if (sum == i) {
			printf("%d ", i);  // 6 28 496
		}
	}

	return 0;
}

// 打印出所有的"水仙花数"
// "水仙花数"就是指一个三位数, 其各位数字立方和等于该数本身
// 例如: 153 = 1^3 + 5^3 + 3^3
//int main() {
//	// 有 100 - 999 的数字
//	int i = 100;
//	for (i = 100; i < 1000; i++) {
//		// 153 / 100 = 1
//		int a = i / 100;
//		// (153 % 100) / 10 = 5
//		int b = (i % 100) / 10;
//		// (153 % 100) % 10 = 3
//		int c = (i % 100) % 10;
//		if (i == pow(a, 3) + pow(b, 3) + pow(c, 3)) {
//			printf("%d ", i);  // 153 370 371 407
//		}
//		
//	}
//	return 0;
//}

